extend_mw_layers
create_mw_lib -technology /home/michaelw/work/tools_demo/syn/topo/tcbn16ffplusglbwp16p90.tf -mw_reference_library /home/michaelw/work/tools_demo/syn/topo/tcbn16ffplusglbwp16p90 ./tcbn16ffplusDesign
open_mw_lib ./tcbn16ffplusDesign
set_tlu_plus_files -max_tluplus /home/michaelw/work/tools_demo/syn/topo/cln16ff+_1p11m_2xa1xd3xe2y2r_mim_ut-alrdl_rcworst.tluplus -min_tluplus /home/michaelw/work/tools_demo/syn/topo/cln16ff+_1p11m_2xa1xd3xe2y2r_mim_ut-alrdl_rcbest.tluplus -tech2itf_map /home/michaelw/work/tools_demo/syn/topo/layer.map
