create_mw_lib -technology /home/michaelw/work/tools_demo/syn/topo/tsmcn28_9lm6X2ZUTRDL.tf -mw_reference_library /home/michaelw/work/tools_demo/syn/topo/tcbn28hpmbwp35 ./cln28hpmDesign
open_mw_lib ./cln28hpmDesign
set_tlu_plus_files -max_tluplus /home/michaelw/work/tools_demo/syn/topo/cln28hpm_1p09m+alrdl_6x2z_rcworst.tluplus -min_tluplus /home/michaelw/work/tools_demo/syn/topo/cln28hpm_1p09m+alrdl_6x2z_rcbest.tluplus
